{"4if65h": ["Mod Announcement: We're considering banning all domains that require users to disable ad blockers and we'd like your input", 12002, "https://www.reddit.com/r/technology/comments/4if65h/mod_announcement_were_considering_banning_all/", [[{"comment": "Do it. \n\nMedia sites need to accept that they can't expect viewers to respect their rights to monetize while they continue to pollute search results to boost their ranking.\n\nI am all for sites with whatever ad-based or subscription business model they want, but as long as they are abusing search results with paywalled information, I'm going to jump that fence and, moreover, look for better news sources.", "id": "d2xkfbw"}, {"comment": "Absolutely do it: http://www.extremetech.com/internet/220696-forbes-forces-readers-to-turn-off-ad-blockers-promptly-serves-malware\n\nI understand they have to make money, but media sites did this to themselves by trusting 3rd party ad networks instead of doing their own advertising like every publication since the printing press. Every time I follow a link and realize that it's Forbes, I turn around and go the other way. Same with other \"you must remove your ad blocker sites\" NOPE, it's there for a reason, and that reason is that you squandered your right to be trusted by trusting MY security to 3rd party ad networks. I'd be gracious that the mods are saving me the effort. ", "id": "d2xuku6"}, {"comment": "My favorite is \"Please rotate your phone to view this ad\". HA! Yeah, you start holding your breath now and I'll let you know when I'm ready.", "id": "d2xvqgy"}, {"comment": "Are there seriously ads that expect you to do extra work to look at their ads?", "id": "d2xz39i"}, {"comment": "The state of mobile ads is probably as bad if not worse than the wild west of the internet with its popups and browser hijacking bullshit. ", "id": "d2y08dn"}, {"comment": "The number of times I've opened a link on my phone only to find myself redirected to the play store for some shitty game (without me pressing a thing on the page, or even scrolling)... It used to happen on imgur, but hasn't for a while.", "id": "d2y0hth"}, {"comment": "Redirects to the play store, opening multiple tabs, getting spammed with popup notifications, overlays with close buttons so tiny they can't possibly be tapped, invisible overlays that open new tabs or redirect you when you tap anything on the page, old fashioned browser hijacking.... \n\nThere's so much garbage in mobile ads that it's unbelievable. ", "id": "d2y0nkp"}, {"comment": "Seriously, it makes watching porn on mobile impossible. Pornhub does it right, no redirects to play store, popups, hijacks etc. The worst they do is a \"click to continue to video\" ad but nothing malicious, which is absolutely fair. I don't even bother clicking other links to porn it's so ridiculous.", "id": "d2y2at2"}, {"comment": "beeg.com\n\nNo ads, HD videos, works on mobile. \n\nHave fun ;)\n\nNSFW (obviously)", "id": "d2y4at2"}, {"comment": "Damn it I had plans. ", "id": "d2y4g4j"}, {"comment": "I've noticed Android is more convenient with this than iPhones because you can just spam the hardware back button, or even change default apps in a way that prevents the redirection to the app store", "id": "d2y11v7"}, {"comment": "Yeah, i can't imagine how awful mobile internet would be without a dedicated back button.", "id": "d2y1d8t"}, {"comment": "If you want a sample, just log in to an Outlook mail account on your phone. Leave it to Microsoft to figure out how to disable your phone's goddamn Back button so you're forced to use the one they put at the top of the page.\n\nEdit: I mean on the mobile version of Outlook.com, not the native app.", "id": "d2y2j83"}, {"comment": "I will... pass on that kind offer.", "id": "d2y2l87"}, {"comment": "Firefox for Android is great for this.  It handles YouTube videos, so I don't have to deal with unskippable ads and other bullshit from the app.  Installed ublock to get rid of mobile ad bullshit. And it has an option to request the desktop site instead of the mobile version. Definitely recommend.", "id": "d2y3gwo"}, {"comment": "[deleted]", "id": "d2y1kch"}, {"comment": "That's a thing? Has any person ever fallen for that?", "id": "d2y5zrh"}, {"comment": "[deleted]", "id": "d2y6efw"}, {"comment": "> disable third party protection\n\n....so, all Amazon app's?", "id": "d2y6vnf"}, {"comment": "The worst offenders are those \"you have a virus\" page which keeps vibrating the phone, creating annoying pop-up windows, opening new tabs to Play Store and worse of all you can't go back to the previous page unless you tap the \"back button\" at a ludicrous speed. ", "id": "d2y1c5g"}, {"comment": "[deleted]", "id": "d2y0cmr"}, {"comment": "[deleted]", "id": "d2xw11t"}, {"comment": "[deleted]", "id": "d2xw9dz"}, {"comment": "'I'd like to slap you on the face, can you take a step closer towards me so I can reach please? Thanks'", "id": "d2xyp54"}, {"comment": "No, some of them are just too lazy/cheap to make an ad that can be done both vertically or horizontally. Why would I go out of my way to watch an ad?", "id": "d2xwapb"}, {"comment": "It's funny, because sites that I legit want to help monetize, get me to turn off my adblock anyway. They don't ask or force me to do it, I do it automatically. Maybe these sites should think about trying that.", "id": "d2xx05m"}, {"comment": "To build off your very relevant comment; I'd be happy to respond to a pop-up after I'd read the article that asked me if I'd like to view the relevant ads that their algorithm had determined I'd be interested in. Hell, I'd consent to tracking if it improved the ads they served me and I was given a chance to read the content first. Doubly hella true, I'd probably even surf my way through as many ads as they thought relevant. Just let me view the content so I can decide if I even think your ads might be of interest.", "id": "d2xybi0"}, {"comment": "I agree. Don't stiff arm me up front from viewing your content solely on disabling my ad-blocker. If you do that, I will go back and find the content somewhere else. \n\nIf you instead create content that I like, and let me view it first, then I will probably support you. ", "id": "d2xytm5"}, {"comment": "I think you're in an incredible minority.\n\nThe majority of people who use adblockers either don't know, or don't care about helping sites monetize. Even among people who know, there are lots who won't go through the extra effort to whitelist sites they like. ", "id": "d2y06xe"}, {"comment": "I got hit with this one and some other forum site.  Both times they told me to disable ad blockers, both times I got hit with popups for malware.  Never again.", "id": "d2xvieq"}, {"comment": "I personally only use 'Ghostery' which seems to work very well. I don't want to block add's and certainly not the revenue for the adds, but the dangerous javascript crap that these unscrupulous advertisers and middle men are injecting is totally criminal.", "id": "d2xzvxw"}, {"comment": "Yours is a good point. I block ad networks. If a site wants to serve an ad from their own domain then that's fine by me.", "id": "d2xvtfv"}, {"comment": "It's not only that but I try and use the forbes site and the thing doesn't even load for a minute. \n\nAnd every damn article is a list with each item on a new page. I don't have the patience to deal with that.", "id": "d2xxa9q"}, {"comment": "Lists are just an inconvenience for readers..  \n  \nUnfortunately someone figured out, that they could increase page views *and* ads, by writing \"articles\" in a list format, and every time you click next, it loads a fresh new set of ads, just for you. Or something like that. For anyone without an ad-blocker it's both tiring, and dangerous, since any one of the 20+ ads that you manage to be assaulted by, could be malware, and for anyone with an ad blocker, lists are just inconvenient, and tiresome.\n  \n\nUnless it's a traditional list, like a shopping, or packing list. Those lists are pretty useful. ;) ", "id": "d2xzkr6"}, {"comment": "As Reddit we have a moderate amount of power - Forbes and Wired would likely notice the decrease in traffic coming from front-page stories.  Let's use our position to send a good message on behalf of netizens everywhere!", "id": "d2xwckz"}, {"comment": "wired really fucked up. For a while they had an article like \"we're redoing our ads to make them less obtrusive! Please disable your adblocker and have a look.\" So I did, and the very first page I clicked on an obtrusive ad on it. \n\nApparently the change to their advertising was coming *later* but they wanted me to disable my adblocker *now*. Who the hell approved that fucking idea? Fix your ads first THEN ask me to disable my adblocker. ", "id": "d2xyqnp"}, {"comment": "Which is why Wired is on my router's blocklist.  I don't want to remember every shitty site out there, but my router can remember (and block it) for me.", "id": "d2y0b0j"}, {"comment": "i've added the entire gawker network to that list as well", "id": "d2y561d"}, {"comment": "Hogan network*", "id": "d2yc9z0"}, {"comment": "I turned off adblocker on Wired once.  Then had video ad autoplay *WITH AUDIO*.  \n\nI haven't been back since.", "id": "d2y4q7c"}, {"comment": "They have to be noticing a drop in traffic. I haven't looked at a Forbes article since they started that garbage.", "id": "d2xxvr3"}, {"comment": "If they haven't noticed a drop in ad revenue they probably don't care though.", "id": "d2xzod0"}, {"comment": "They do rely on their stuff to be spread by the internet community\n\nIf less people are watching your article those people are also not showing it to their friends or making threads/facebook posts/posts on forums/twitter posts about it , which means less clicks, which means less people without adblock viewing it.\n\n", "id": "d2y0090"}, {"comment": "I don't think it would be as big of a deal to them. Not everyone, but I would imagine a good chunk of /r/technology uses ad blockers and/are web-savvy. If they get blocked in a community where the majority of the people block their revenue source anyway, what's the big deal? Sure, there are some people that don't run ad blockers (or whitelist), but its probably not that many (at least in this community).", "id": "d2xzi6u"}, {"comment": "What does abusing search results mean?\n\nHow are they abusing search results?", "id": "d2xo18r"}, {"comment": "They're obfuscating content by making a promise of results that aren't actually available to the majority of searchers. They're turning search results into free advertising without actually providing the content that turns up (without an additional fee).", "id": "d2xoa7e"}, {"comment": "Could you demonstrate this? Sites I have used such as financial times and WSJ will give you all the content if clicked through google.", "id": "d2xtxir"}, {"comment": "They basically have a script that detects if you're a search engine's web crawler. If you are that, then they will provide you with content needed to make their search result seem good. The content that is indexed by the bot is not the same as the content provided to the user at face value. That user either has to pay a fee, register, like something, etc.", "id": "d2xvkxy"}, {"comment": "Oh yeah, ExpertsExchange made this bait and switch tactic famous before StackOverflow basically ran over them.", "id": "d2xxte4"}, {"comment": "[deleted]", "id": "d2xz2u5"}, {"comment": "Can this be circumvented by using the Google cached site?", "id": "d2xxfom"}, {"comment": "If you use firefox, you can also use the \"random agent spoofer\" addon to pretend to be a webcrawler.", "id": "d2xztwx"}, {"comment": "Yes I fully agree. Do it. ", "id": "d2xve8c"}, {"comment": "Playing devils advocate here, how are sites supposed to make money?", "id": "d2xzmg8"}, {"comment": "Personally I have no problem with unobtrusive, targetted ads.  If I'm reading a story about SSDs then there's a good chance I'll be interested in buying PC components.  Put a few small ads along one side of the page that don't obstruct content.\n\nYou'll get a lower clickthrough rate, but much much higher conversion.  Don't start playing sound in my browser, or splash a page I have to click away, or break up the story with adverts that start playing a video EVERY time I move my cursor anywhere near them.\n\nI have my ad blocker set passively.  I don't block any site unless it takes the piss.", "id": "d2y3occ"}, {"comment": "The important point here is that running scripts for advertising that has not been vetted and could infect (and has infected) customers is irresponsible.  They need to find another way, and if a site were to serve ads responsibly, we should support that.  Until then, we should continue to protect ourselves with ad and/or script blockers by default.\n\nEdit: autocorrect argh", "id": "d2xyxbk"}], [{"comment": "The best way to encourage responsible ad sourcing is to cut into the revenue from the standard model. I say ban away. ", "id": "d2xkfq4"}, {"comment": "What do you think will come next? Paywalls and sponsored content are far worse than banner ads.", "id": "d2xtzxh"}, {"comment": "Do you not realize how much malware comes from ad networks?!\n\nEDIT: blah blah Teach a man to fish instead of browbeating him about not knowing how malvertising works\n\nhttp://arstechnica.com/security/2016/03/big-name-sites-hit-by-rash-of-malicious-ads-spreading-crypto-ransomware/\n\nhttps://en.wikipedia.org/wiki/Malvertising ", "id": "d2xunwj"}, {"comment": "I agree. I block ads because I don't wanna see spammy shit, and of course there is the protection from malware.\n\n\nIf websites get some sense they would have non-obtrusive (text based?) advertising that adblock (can) allow through.", "id": "d2xv3uf"}, {"comment": "I block ads because I don't like malware, and because the ads are plastered all over the middle of the article, made to look like legitimate articles, pop-up in the middle of my fucking screen requiring my input, make pages take FOREVER to load, and start playing fucking videos.\n\nI would disable on any site to just displays ads to the side of the content.\nI would disable on youtube if I only had to watch 15-30 second commercials, with no long commercials that require my input to skip. I honest to god would.\n\nNobody will ever do these things tho.", "id": "d2xx86t"}, {"comment": "They would if the returns on it were worth it. People who block ads are the minority by far however and they make more money by showing ads to 90% of their users that are intrusive ", "id": "d2xxl80"}, {"comment": "I'm guessing that it's not so small of a minority of they're investing money in detecting and blocking access to those users.", "id": "d2xxz7g"}, {"comment": "I looked around on google and it's around 10 percent of overall users but it's incredibly common among millennials apparently and that might be why they are driven to create software. \n\nBut on average it's less then 10 percent of impressions but some websites hit as high as 50 percent. \n\n\n\nhttps://econsultancy.com/blog/67019-12-alarming-ad-blocking-stats-that-reveal-the-size-of-the-problem/\n\nEdit: I've linked to that website because the creators of the original report have more or less deleted there website and I can't find the report. ", "id": "d2xy6sc"}, {"comment": "The solution is simple. The sites that want to serve ads can do it from their own domains, rather than ad serving domains. Like every magazine, newsletter, periodical, etc., that has ever existed in the past. Then they have control over what's gets served and must take responsibility for the malware loaded from their domain. The people buying the ad space then can't do a bait and switch to load malware. Everybody wins. As it stands now they all want full access to your computer but want zero responsibility for it.", "id": "d2xxyb9"}, {"comment": "No one really wins with publishers having to organise their own. \n\nManually bought advertising, instead of automated through third party, is generally more expensive per ad unit. Websites frequently over value their adspace and lack the technology to give the same demographic information as the bigger third parties - adX, doubleclick, mediamath etc. \n\nSo advertisers and publishers have no real interest in buying like that if they can manage it. The other option is to build an automated platform for your website, which avoids third party but its hugely expensive to implement. \n\n\nSome, given good advertisers, of the networks are pretty good at delivering relevant adverts too, which is less likely for manually served. The user only really wins when the ad network develops better policies, which hardly anyone seems to be addressing. ", "id": "d2y00b8"}, {"comment": "Traditional advertisement, without any kind of tracking or customization.  \nMuch like newspaper ads, pay for the space, not for the click/view.  \nI believe this will reduce the motivation for click baits, and ads will shift towards actually being informative about products, instead of \"click here to get $1145\" hooks.", "id": "d2xyejl"}, {"comment": ">far worse than banner ads.\n\nGosh, I wish all we had were banner ads these days. Looking at a news site with and without uBlockOrigin is like looking at two different publications. The highest the block counter got for me was 118. 118 items blocked. And who knows how many of those were malware, or were tracking \"pixels.\" We're not talking about a few ads for vacuum cleaners on a housekeeping forum.", "id": "d2xyums"}], [{"comment": "[removed]", "id": "d2xyjwf"}, {"comment": "Websites can have static ads which no ad blocker can block (no non customized ad blocker)\n\nWebsites can earn ad revenue in safe and respectful ways, but they aren't doing that, so my ad blocker stays on for my safety.", "id": "d2y64fx"}, {"comment": "[removed]", "id": "d2y71b5"}, {"comment": "Ad*\n\nBut anyway, those kinda of ads run on a different model, rather than pay per click/view, it's simply pay to have the ad hosted. Similar to a news paper or magazine. \n\nEssentially, what they could do is estimate viewership and set a price around that. It's probably far less money than what they get, even with people adblocking, though. \n\nIf paper print could serve ads like websites do, I'm sure they would.", "id": "d2y76g3"}, {"comment": "This is exactly the problem. Also, the amount of legwork that would need to be performed to reach out to companies wanting promotion individually would negate part of the earnings from the ad. ", "id": "d2y75i2"}, {"comment": "You mean the model newspapers have had since they were invented? I don't think it is unreasonable for sites to either serve their own ads or use a third party that only serves static images. ", "id": "d2y7dr3"}, {"comment": "Exactly. \n\nWebsites have an answer to ad blocking, the problem is that they just don't like it. ", "id": "d2y90yn"}, {"comment": "I always found it funny when forbes is like \"thanks for disabling ad blocker, here is our ad light experience\" while in the background they feed you malware. ", "id": "d2y4e62"}, {"comment": "Its even worse than that - if you agree to sign up for their log-in-via-Google thing in order to remove ads instead of removing adblocker, you have to agree to let them manage your contacts lists for you. (And in the TOS you still are agreeing not to use an adblocker anyway, lol.\n\n", "id": "d2y8j32"}, {"comment": ">you have to agree to let them manage your contacts lists for you.\n\nThat is the slimiest and most ridiculously stupid thing I've heard in a while. Why the hell would a news site need to control your personal contact list from an unrelated service? There is literally 0 benefit to that for anyone but their marketing department. That should not be legally binding in any way, and I'm seriously questioning if it even is.", "id": "d2yda1v"}, {"comment": "You can cancel the obligation by going to Google account manager and removing the 0auth ticket for Forbes.", "id": "d2y972u"}, {"comment": "They have already downloaded your contacts by then though", "id": "d2ygv1u"}], [{"comment": "Do it please. I won't click on them anyway, but I would just as soon not have to see the link.", "id": "d2xjxut"}, {"comment": "Agreed. Ads are foul, and viewing a headline could effectively be viewing an ad anyway. \n\nI also want to see Reddit do something about ads in the comments or ads disguised as submissions. Not to get all Hail Corporate over here, but it must be admitted that this takes place. And [according to this mountain of information](https://np.reddit.com/r/shills/comments/3uoxpl/internet_shills_101/), it's becoming quite the problem. Political ads disguised as Reddit comments? We have to do something about this. ", "id": "d2yed2l"}, {"comment": "> Ads are foul, and viewing a headline could effectively be viewing an ad anyway. \n\nSo how should news sites get revenue, according to you?", "id": "d38lh91"}], [{"comment": "Paywall sites and sites blocking ad-blockers should be tagged with a warning.\n", "id": "d2xk5wv"}, {"comment": "Paywalls should just be banned. They're litter for 95% of redditors.", "id": "d2xtd00"}, {"comment": "Not the mention the shills that post them in hopes someone will pay.", "id": "d2xu6e8"}, {"comment": "Also not to mention the fact that Reddit taking a stand like this is going to send a clear message to sites like Forbes. It will be clear that Reddit will not drive traffic to their sites like they have always done if they don't fix their approach to this issue.  Like any business, if they treat their patrons like shit, like a source of income whose preference doesn't matter, we should boycott them. ", "id": "d2xzn78"}, {"comment": "[deleted]", "id": "d2y0m29"}, {"comment": "Even on reddt, a susbtantial portion of viewers don't use adblock. I'd imagine reddit posters have an even higher use of adblock than reddit viewers, aswell, so it's hard to acccurately estimate. ", "id": "d2y27rb"}, {"comment": "Usually the content gets posted by some based throwaway.", "id": "d2xukmw"}, {"comment": "I disagree with that. \n\nThe paywall sites suck for regular users, but they have that as a reasonable business plan for their subscribers. \n\nI think a warning should suffice for those sites, but often times the information is good and WSJ is a reputable site. \n\nI would much rather deal with a paywall than give page views to a shitty blogging site rehashing the original content from the paywall site. ", "id": "d2y08xl"}, {"comment": "No, fuck the warnings.  We still have to scroll past all that shit.\n\n**Ban them outright**", "id": "d2xxrjo"}, {"comment": "I think this is a fair compromise. Poor advertising practices aside, I think it should be up to the user to decide if they want to view a website with anti-ad-blockers in place. Most of reddit seems to find this type of practice appalling, but I'm more for allowing the users to decide for themselves than for banning them outright. if I see a pawall and/or anti-ad-block warning I may not click the article, but it might still be good for me to know that the article exists so I might educate myself on the topic through other means. \n\nEdit: I think, at the very least, we should start with a warning and see how it goes, then see if we should consider banning it all together once we see what happens. ", "id": "d2xti2z"}], [{"comment": "Drop the banhammer. Drop it hard.", "id": "d2xmxw4"}, {"comment": "Yeah, it isn't like we'd have a hard time finding alternate domains to use.", "id": "d2xynnk"}], [{"comment": "How will the ban list be maintained? Can you alter this reddit to have the Report options show \"Ad Blocker Blocker\" or something like that? ", "id": "d2xlqo3"}, {"comment": "We could do that. The enforcement part would come from automod. ", "id": "d2xlwwy"}, {"comment": "Yea... if you start doing that please please please make the list of sites banned and the reason that site was banned. Sticky it or post it in sidebar so there's an easy place to point the curious.\n\nBe open about sites you ban and why, and please don't let that power go to your heads.\n\nThose would be my requests/concerns, thanks for maintaining the sub, and ban away.", "id": "d2y52iu"}, {"comment": "Exactly this. Please!", "id": "d2ybw31"}, {"comment": "This. An open list of sites and why it was banned. A simple \"Fullscreen blocking panel.\" or \"Invasive popups.\" is enough.", "id": "d2ygcgt"}, {"comment": "It'd be great to see something like git used for the list so we can see publicly where and for what reason sites are added/removed from the list.", "id": "d2y3mzu"}, {"comment": "That works, but the [wiki](https://www.reddit.com/r/technology/wiki/index) means the content doesn't have to be hosted off-reddit. It's versioned and can be accessed [in JSON form](https://www.reddit.com/r/technology/wiki/index.json) too.\n\n-\n\n^^^Yes, ^^^it ^^^just ^^^says ^^^\"test\" ^^^right ^^^now. ^^^I ^^^have ^^^no ^^^idea ^^^why. ^^^:P", "id": "d2ye0ol"}, {"comment": "Send me your automoderator rule once it's done,  we'll add it our sub as well. ", "id": "d2y6t56"}], [{"comment": "Extremely agree they should be banned. ", "id": "d2xl602"}], [{"comment": "Yes, please ban them. Intrusive, forced advertising along with the threat of malware? No thank you. I like the idea of an auto flair \"not safe for browser\" as a middle compromise. ", "id": "d2xygs0"}, {"comment": "I'd also be more than happy with that compromise flair if it comes down to it, but yes please ban them. My ad blocker stays on for my own safety more than anything.", "id": "d2y70bp"}], [{"comment": "Instead of banning Forbes articles you could say that those articles are only accepted if they are put on archive.is or a similar archiving site. This allows people to view it while taking into account security concerns. ", "id": "d2xk7px"}, {"comment": "Since blocking Forbes is a domain block it wouldn't block archiving sites anyway. If those were blocked it would have to be a separate block.", "id": "d2xy3v9"}, {"comment": "Ever since I discovered voat, I fell in love with archive.is - it gives you exactly what you want, without patronizing sites with good content but who obscure it with crap. \n\nForbes is the worst offender. I love archive ", "id": "d2xw61o"}], [{"comment": "Ban paywalled, warn about adblocked.", "id": "d2xtpkp"}, {"comment": "It's sad that votes alone aren't enough to bury paywalled articles, because it just proves how few people are even clicking the links.", "id": "d2xxs08"}, {"comment": "Or how many articles that reach the top of major subreddits are there because of bots and paid users manipulating votes. ", "id": "d2xync4"}], [{"comment": "Yes, do it.  Advertising has reached toxic levels online due to lack of consideration and sometimes lack of ethics in how they shove the ads at users.  In some cases adblock is required as it's the only way to actually experience the content that they were \"offering\" (ie: bait and switch).  \n  \nIf reddit blocked users for using ad-block, I'd have no problems going away, as I look down on site ads that much.  I simply don't trust people to do it right.  Not to mention a few very large zero-day malware attacks were delivered though poisioned ads on legit sites.   \n  \nI don't have time to clean my computer, so I'd prefer to not have that infection vector in the first place.", "id": "d2y02m5"}], [{"comment": "I checked into getting a Forbes subscription so I can pay them for content without seeing ads. I ended up not signing up. They don't stop ads even if you pay for a subscription!\n\nTL;DR - screw these guys.\n\nEdit: add screenshot of the correspondence  http://i.imgur.com/j2W8cOS.jpg ", "id": "d2y25pg"}, {"comment": "So what's the value in the subscription?  You get to pay for malware?  Am I'm missing something?", "id": "d2y4qr0"}, {"comment": "I think he was asking about the magazine subscription.  \n\nThere are parts of the Forbes site you can subscribe to though, like their Real Estate Investor thing for $199/year, but that is for very specific industry information.", "id": "d2y5r1c"}, {"comment": "I had no idea wtf", "id": "d2y3lbq"}], [{"comment": "Sites like Forbes and Wired that deliberately and maliciously abuse our trust should be banned.\n\nPaywalled sites - possibly including the WSJ - might be different though.  But only if there is a reasonable expectation that the reader can get enough of the content to understand the point of the reddit post.", "id": "d2y0em0"}, {"comment": "I think paywall sites should be flaired with \"Paywall\" so people know to follow the link or not, at the very least. I wouldn't care about a ban on them.", "id": "d2y4ldz"}, {"comment": "I agree completely that just because WSJ is pay-walled doesn't mean it should be banned, it is a quality publication. Furthermore you can always just copy and paste the title either in a new tab or even in an incognito window to view the vast majority of wsj articles.", "id": "d2y1rbo"}], [{"comment": "Yes!  The king shall recognize this peasant revolt and sign the Magna Carta.", "id": "d2xjie2"}, {"comment": "The king signed the Magna Carta under pressure from the nobility, not the peasants.", "id": "d2xw5po"}, {"comment": "The nobility being the mods here.", "id": "d2xx6pv"}], [{"comment": "You could tag these sites (eg NSFW), instead of banning altogether. Then the user could decide to click. \n\nEdit: not literally the tag NSFW, but something like it. ", "id": "d2xjloa"}, {"comment": "Misusing the NSFW tag like that would be confusing, but it is would be possible to auto-flair these types of posts as something else. ", "id": "d2xlkhz"}, {"comment": "\"NoAdblock\"\n\n\"Paywall\" \n\n\"NSFB\" (not safe for browser) \n\nare examples of what I had in mind. ", "id": "d2xm55u"}, {"comment": "Oh, okay. Yes that could be done. ", "id": "d2xmczi"}, {"comment": "\"Adblock Blocker\"\n", "id": "d2xpyxp"}, {"comment": "I think the above poster meant a tag LIKE the NSFW tag, not literally labeling them as such.", "id": "d2xm5bm"}, {"comment": "I hate the NSFW tag being used for anything other than NSFW though (well and for use with NSFL as long as the post says NSFL)", "id": "d2xlls2"}, {"comment": "This is a good middle ground. Censorship is bad (who will watch the watchman?) but awareness is good. ", "id": "d2xk5d1"}, {"comment": "It's not censorship in any way, shape or form. Nobody is suggesting you can't go to those sites. I'm all for disallowing sites with Paywalls or that require adblockers be turned off. I pretty much 100% of time close those pages when they're linked here. The ones that let you read for a while then hit you with a timed message are especially irritating.", "id": "d2xm4lz"}, {"comment": "Or/Additionally, create a bot that would provide a text copy over at pastebin, or an equivalent, for posts that are flagged as being paywalled. ", "id": "d2xl424"}, {"comment": "That sounds totally legal ", "id": "d2xvlez"}, {"comment": "it's hard to see tags on mobile devices and clients", "id": "d2xssxm"}], [{"comment": "It wouldn't impact my life much because I refuse to go to those sites anyway.\n\nI'm for it.", "id": "d2xtge7"}], [{"comment": "I think the companies are entitled to their ad revenue. Although I would say that if the alternative is just standing by while the copyrighted content of the site is posted in the comments (\"for those with ad blockers\"), then at that point you might as well just block the sites.\n\nI ultimately would like to see the votes take care of burying these sites if they aren't providing useful content to those who click their links.", "id": "d2xo4zq"}, {"comment": "> I ultimately would like to see the votes take care of burying these sites if they aren't providing useful content to those who click their links.\n\nThis is why I don't quite understand why mod action has to be taken in the first place. Site didn't serve you well? Downvote.", "id": "d2xtcyg"}, {"comment": "It sounds good, but it doesn't seem to work. I see shit from sites like that on the front page all the time. ", "id": "d2xugxu"}, {"comment": "Then perhaps they're providing valuable content to some? ", "id": "d2xw3tu"}, {"comment": "It's more likely people are just reading the title of the post and upvoting as opposed to actually going to the site and reading the article or even the comments. Hence why these get upvoted to the front page. ", "id": "d2xwvf3"}], [{"comment": "Thank you. I absolutely hate Forbes websites. Fuck them. First they force feed you a quote and then ad blocker shit.", "id": "d2xzrmv"}], [{"comment": "Just ban it imo since I close the site immediately once I get the msg that I need to disable my ad blocker to view it. \n\nYes I get it that they are dependent on ads for running but forcing me to disable ad block isn't the way to do that without even allowing me to try if I like the site or its content first. \n\nSimple as that. I just exercise my freedom of not being confined to that new site for my news source :)", "id": "d2xuo1x"}], [{"comment": "Websites need to make money too. I understand disabling Adblock is annoying and could potentially be a security risk (the Forbes malware is news to me) but I think punishing all sites that ask to be whitelisted is a bit unreasonable. ", "id": "d2xjiow"}, {"comment": "The problem is that almost every site outsources their ads. So even if you trust the site you can't trust their advertisers or the companies serving those ads.\n\nEdit: [Link](http://www.networkworld.com/article/3021113/security/forbes-malware-ad-blocker-advertisements.html) for reference. \n\n", "id": "d2xuf8b"}], [{"comment": "do it.", "id": "d2xkpb4"}], [{"comment": "Totally against disabling ad blockers but also totally against your way of dealing with this situation. What kind of messed up censorship would that be?!\n\nIf people wish to post links from such domains and people really want to visit said domain and disable their ad blockers, it's their free will to do so. \n\nYou could have a disclaimer that warns the people or tag such post with [paywall]. But I really don't see the need to restrict freedom the way you suggest.\n\nCorrect me if I have mistaken any of your intentions. ", "id": "d2xy9ye"}], [{"comment": "Banning is preferred, but tagging them would be a nice middle-ground. Is there any way to filter reddit so that those who refuse to use those sites won't see content with those tags?", "id": "d2xsj1v"}], [{"comment": "Yes, I support the ban.", "id": "d2xyh6y"}], [{"comment": "DO IT DO IT NOW\n\nDO IT DO IT NOW\n\nDO IT DO IT NOW\n\nDO IT DO IT NOW\n\nDO IT DO IT NOW...............................", "id": "d2xzno4"}], [{"comment": "Censorship always sprouts with the best of intentions.  I do not click to Forbes, except once every 3 months to see if they have matured and changed their ill-advised policy of denying access to those who use ad-blocking.  I prefer to be my own censor.", "id": "d2xv12y"}], [{"comment": "[deleted]", "id": "d2xlldm"}], [{"comment": "Tagging is a far better solution. Plenty of people don't use ad blockers.", "id": "d2xnfk9"}], [{"comment": "If you could ban Forbes that would be great.  If you allow ads they serve up [malware](http://www.networkworld.com/article/3021113/security/forbes-malware-ad-blocker-advertisements.html) if you keep your ad blocker on you can't see anything.\n\n[Financial Times](www.ft.com) could do with blocking as well.  Nobody has a subscription to it. ", "id": "d2xtcix"}, {"comment": "The biggest problem, with Forbes, is that 98% of the links that are posted are from contributors, not actual Forbes staff. They're more like blogs than actual articles.", "id": "d2xyd88"}], [{"comment": "Maybe not banned, but definitely tagged ", "id": "d2xqv3a"}], [{"comment": "For sites that have content behind a paywall, a simple tag notifying redditors that the link leads through that wall would be good.\n\nFor sites that require you to disable ad blockers before serving content, a similar tag would be good. Personally, as soon as I see a page asking me to do so, I just leave. Having a tag would save time.\n\nSites that serve malware should be banned and the list of banned sites should be public. ", "id": "d2y0xfp"}], [{"comment": "I definitely agree that sites that require you to disable ad blockers or have pay walls should no longer be allowed. I use mobile a lot when browsing Reddit and Forbes wont let me read anything on it because the site believes I am using an ad blocker all the time (which I am not).  If people stop using sites with these types of barriers, maybe the reduction in visitation numbers will convince these sites to cease such practices in the future.", "id": "d2xjvcu"}], [{"comment": "Please do. Whenever I accidentally click on a Forbes link, it's nothing but irritation. Sites like that have no place on the internet, and we shouldn't send any traffic their way. ", "id": "d2xpxgb"}], [{"comment": "Absolutely ban them. It's not as if their content is critical to keeping us all erudite. I stopped visiting those sites when they began their absurd demands.\n\nThose demands demonstrate the potential dangers of such sites delivering malware since they seem to be rather clueless about the internet to begin with.", "id": "d2xyjp5"}], [{"comment": "I don't care about anti-Adblock sites (since I'm one of the rare here who doesn't use it), but I'd ban sites that serve malware IMO. That should not be allowed at all.\n\nForbes should go.", "id": "d2xzlwz"}], [{"comment": "Force websites to use responsible as practices rather than force me to view their crappy website that's bloated with ads", "id": "d2xulsr"}], [{"comment": "COMPLETELY agree. Ban away.", "id": "d2xkqlk"}], [{"comment": "I'd prefer flagging posts that lead to these sites, give the user the option to ignore or filter those results (similar to NSFW). Educating your users should be preferred over making decisions for them.", "id": "d2ycm0s"}], [{"comment": "I'm all for it gents, Forbes links are annoying as shit because of paywalls ", "id": "d2y06ld"}], [{"comment": "Absolutely, ban away. I'd hate to waste any of their bandwidth in the first place since I'm **never ever fucking ever** going to disable my ad blocker for some web site. No content's that good and if it is, it's available elsewhere. ", "id": "d2xm28g"}], [{"comment": "100% agreed.\n\nThe internet is becoming more savage, less safe, and more intrusive. Any site that forces me to view its ads but refuses to scrupulously prevent any of them from being malware is not something I ever wanted presented to me.", "id": "d2xwmjo"}], [{"comment": "Yes!  PLEASE do it!  I refuse to turn off my blocker (Ad Block Plus) as it doesn't block ALL ads, just those that represent security risks and major annoyances. So, it's a little irritating to follow a link and then be denied the content.  I'd rather not visit the site at all!  Their revenues will drop much further if aggregators, such as Reddit, won't link to them.  This puts financial feedback on the site, which is what is needed to change the policy!", "id": "d2xzv5p"}], [{"comment": "Ban them.\nI absolutely hate loading Forbes.com because they have forced pop-ups: so yes, please ban sites that troll its users!  I always press \"BACK\" when their site starts to load.", "id": "d2xwpmk"}], [{"comment": "I think they should be tagged personally, so people are aware of them.", "id": "d2xqatw"}], [{"comment": "Forbes needs to be banned anyway. Their articles are garbage.", "id": "d2xrlq0"}], [{"comment": "I fully support this. They can act like disabling ad block is the right thing to do, so that they get ad revenue to keep running their sites, but things such as malware being delivered through ads just makes it inexcusable. Anti-adblock walls, and paywalls should definitely be banned (especially the latter).", "id": "d2xu3gk"}], [{"comment": "Thank you please. Good bye Wired, Forbes, and friends. I'm sick of the shitty popups and mal-adware and sick of them telling me to disable if I want to read their fine content. I'd rather just not even come across it again.", "id": "d2xvtex"}], [{"comment": "Do it!\n", "id": "d2xo2a8"}], [{"comment": "[deleted]", "id": "d2xs8x9"}], [{"comment": "Here's another vote for ban.\n\nI will never alter security settings on my devices to view content on any particular website.", "id": "d2xtqwj"}], [{"comment": "Honestly, I'm not sure if that's the right response. I find it annoying when sites do this, but I find it less annoying when, say Wired does it (their ads are not *horrible*) than when Forbes does it.\n\nThere's probably no reliable way to distinguish those though, since different people will have different thresholds for when ads become intolerable.\n\nBut I think tagging them, as /u/lgats suggested, is a good idea.", "id": "d2xqu4l"}], [{"comment": "Yes ban them", "id": "d2xtuz1"}], [{"comment": "I've tried to bring this subject up with some of the economics subs. No traction yet. So I'm with you.", "id": "d2xu752"}], [{"comment": "please do this. it needs to happen. \n\ni hope google will consider how they rank paywalled articles in their search results ", "id": "d2ycxdf"}], [{"comment": "Ads suck, we all know and agree on that.\n\nYes websites need to make money too. I get it, money makes the world go round.\n\nThat said, I do not agree with a website forcing me to see an ad to read their content.\n\nI say ban them until they see how bullshit that practice is, if they ever do.", "id": "d2xjyd4"}], [{"comment": "I agree. Sites that are willing to compromise visitors computers, or track and trade information should not be encouraged to continue these practices.", "id": "d2xkob9"}], [{"comment": "I think this is a great step in the right direction, a few times I've clicked on a shortened link only to end up at Forbes' 'disable your adblocker' message. Ad blocking is implemented at my DNS server for ad delivery, analytics, and other unsavory domains. There's no way I'm changing this for one site, so I just go elsewhere for the news.\n\nAt least with an ad riddled newspaper I can throw away the ads easily, this is like a glue that can't be removed without staring at the ad for a predetermined time. It's BS, screw em if they don't want to find a non-invasive manner of delivering ads. Seriously since they make money off the ads, is it too much to ask an employee to screen said advertisements for malware?", "id": "d2xwdyy"}], [{"comment": "i think tagging such sites is a good first step. i don't think it's fair to expect free content everywhere on the web, and i think that as long as you've been warned, it's up to you to decide whether or not you want to visit a place that requires you to turn off your ad blocker.\n\ni think it would be great to tag clickbait sites as well, because i believe their intent is the same as sites that don't like adblockers. everyone's in it for the money, but some domains don't care if they abuse their viewers' trust.", "id": "d2xxu3s"}], [{"comment": "I know this is kinda buried but I don't think you should. Pay walls I think would be a reasonable ban, but even still I think it should just have the proper flair. As it stands, ads are how a company make money. If they would like someone to pay, I don't think it's unreasonable for you to oblige. You can always not look at the content.\n\n**TL;DR:** Flair don't ban", "id": "d2y0fb8"}], [{"comment": "uBlock Origin has no issue with those sites. Not all adblockers are created equal.", "id": "d2xobyt"}, {"comment": "Great on desktop, fucked on mobile. Just ban them ", "id": "d2xubol"}], [{"comment": "Ban them ", "id": "d2xrn5a"}], [{"comment": "Do it", "id": "d2xry95"}], [{"comment": "I support the ban. The fewer clicks they receive the better.", "id": "d2xsi4s"}], [{"comment": "I won't ever read articles on sites that would be effected by this change. Ban or tag away.", "id": "d2xu0u7"}], [{"comment": "Fuck Forbes.", "id": "d2xw4ff"}], [{"comment": "Ban both.  The \"disable ad blockers\" trend is one that needs to be crushed now.\n\nOr eventually tricked later by new add ons!", "id": "d2xw56g"}], [{"comment": "I say ban them. If they're resorting to forcing ads, odds are the information in there is mostly opinion anyway", "id": "d2xmrl9"}], [{"comment": "Nuke 'em. ", "id": "d2xrdal"}], [{"comment": "Absolutely ban all websites that use anti-adblockers and pay-walls, every single one...  /r/WorldNews and /r/News should implement this in conjunction with you immediately as well, if /r/Technology mods wouldn't mind contacting them to do so.", "id": "d2xvi9j"}], [{"comment": "I must be a strange beast, a unicorn in a human's body perhaps. I don't mind ads, and I don't mind viewing them. People produce content, they deserve some time of reward in exchange. \n\nAdmittedly, I use Linux so the risk of ads riddled with viruses is lowered. Also, annoying ads do get me to block the ads on your site. ", "id": "d2xy750"}], [{"comment": "I had never even heard of the malware thing. No one's going to force me to turn off ublock, so I've never paid attention past that. I just don't click on forbes links. But I googled it to check. Here's [forbes smearing the guy that pointed it out.](http://imgur.com/PWgpPT4)\n\nRealistically, it probably wasn't forbes's fault, it was probably their ad network. And they had probably removed it by the time they asked him to retest it. But if you're going to force people to bend to your will, you better have your shit together. And you better not give them shit for calling you on it when you fuck up. This was THE reason we run adblockers. \n\nBlock them here or don't, I don't care, [I found this.](https://addons.mozilla.org/en-US/firefox/addon/blocksite/) And for [Chrome users.](https://chrome.google.com/webstore/detail/block-site/eiimnmioipafcokbfikbljfdeojpcgbh?hl=en)", "id": "d2xzk0p"}], [{"comment": "I agree with these actions, summed up in the other 2000+ comments, it might help to send a message. ", "id": "d2y9ho1"}], [{"comment": "Do ittttttt", "id": "d2y9lh6"}], [{"comment": "I support this move! ", "id": "d2y9ud7"}], [{"comment": "I have no problem with this, in fact I would like to see all of Reddit ban these sites.", "id": "d2ya575"}], [{"comment": "I work at the difficult end of the break fix spectrum, I am a workshop manager. I spend my days cleaning out and securing my clients machines against malware and viral infections. I purposely implement ad blockers on all the machines that come across my benches. I am well read on the subject matter and follow the news and views around this subject avidly. I fully understand the mechanisms used for the delivery of advertising and the methods used to restrict and block the majority of ad feeds. \n\nI would support this move by the mods to ban such sites. \n\nFor such a long time the adverting industries and the website managers who allow and control the feed of adds to my clients have had a complete, and I mean complete, disregard for the damage that they daily cause and authorize.  I make a living from cleaning up the mess that the bad practice this industry creates, and it costs my clients there hard earned cash. I would rather not take it from them, that’s right, I’d rather my clients where able to surf the web without the risk of intrusion and infection. I feel that so long as the shoddy practice of serving malware infected adds upon the unsuspecting public continues then an action such as is proposed by the mods is, in my opinion, fully justifiable.\n", "id": "d2yamhc"}], [{"comment": "I absolutely agree. In my opinion, Adblockers are like condoms for the internet. Any site that tells you \"You don't need that, it'll be fine\" shouldn't be trusted, as ads have been one of the most common sources of computer viruses in one form or another since shareware lost popularity.", "id": "d2yd7w7"}], [{"comment": "Yes, ban both adblock blockers and paywalls.\n\nThe first are overtly refusing to accept users' terms.  The second are trying to have their cake and eat it too:  viral content propogation whilst refusing to present content to those who come at it via link aggregators and discussion sites such as Reddit.\n\nBoth actively thwart Reddit's intended aim:  informed discussion of an article _by having read it_.  If they don't want to participate, then don't participate.\n\n**That said, high-quality information has a very serious revenue problem, and I'd like to highlight that.**\n\nIt's a topic I've explored in some depth, \"[Why Information Goods and Markets are a Poor Match](https://np.reddit.com/r/dredmorbius/comments/2vm2da/why_information_goods_and_markets_are_a_poor_match/)\".  Or if you prefer a real economist, Hal Varian's \"[Markets for Information Goods](http://people.ischool.berkeley.edu/~hal/Papers/japan/index.html).\n\nA frequently proposed solution is micropayments.  I don't see those as viable, Clay Shirkey, Nick Szabo, and Andrew Odlyzko have all written at length on why not.\n\nRather, a universal content tax or broadband tax seems an alternative.  Phil Hunt of Pirate Party UK and Richard M. Stallman of the Free Software Foundation have suggested this, I'd made my own [universal content syndication](https://np.reddit.com/r/dredmorbius/comments/1uotb3/a_modest_proposal_universal_online_media_payment/) suggestion some time back.\n\nI've also done some back-of-the-envelope calculations on amounts.  _Total_ global ad spend in 2013 was $500 billion, online was $100 billion.  If _only_ the world's richest 1 billion (roughly:  US, EU, Japan, Australia) were to contribute to this, the tax would be $100/year to eliminate _all_ online adverts, and $500/year for _all advertising entirely_.  The money could fund existing creatives -- writers, editors, film producers, journalists, and musicians -- at roughly _twice_ today's compensation.\n\nIt's worth a thought.", "id": "d2ypjp0"}], [{"comment": "I approve of this, and the reasons why. \nFurthermore this could help curb some of the blatant \"viral marketing\" which only serves to drive more views onto a site profiting from ads. (ie, clickbait) ", "id": "d2yb3x8"}], [{"comment": "I can't use Forbes on my phone. It says I'm using an ad blocker even though I'm not. So fuck 'em.", "id": "d2ybomu"}], [{"comment": "I immediately leave sites that have paywalls (even when they allow a few \"free\" articles) or require the disabling of my ad blockers.\n\nI am all for banning these domains.", "id": "d2ybqbc"}], [{"comment": "I'm going to say **don't block** in this sea of \"BLOCK THEIR ASSES\" upvote party.\n\nMark, tag, flair, discourage, whatever. But by blocking you are also preventing the potential of unique articles that might not be on other sites.\n\nLet the user choose whether they want to view the ads/disable their ad blocker.", "id": "d2yh844"}], [{"comment": "Please do this, just make sure to unblock them when they decide to go back, but considering forbes malware ads, keep them blocked until they fix that.", "id": "d2yhpky"}], [{"comment": "How about just flagging the domain... not banning it. Let the user decide.\n\nI will certainly whitelist a domain I like.", "id": "d2ylsu3"}], [{"comment": "I think it's OK to let sites that allow viewing a single article but not clicking links to other articles without paying. That seems like a good compromise.\nI don't use ad blockers, so I don't think banning sites that require them to be disabled is a good idea. maybe make that a setting for the individual user. That way people who don't feel the way I do can avoid those sites while people like me who don't care can see the links.", "id": "d2xvt0r"}], [{"comment": "I agree to some extent, in that we should warn websites that we feel use too many adverts that disabling adblocker makes it an eyesore, and if required, ban domains on a case-by-case basis.\n\nI have no issues with the majority of advertisements. Many of them are unobtrusive, relevant, and don't affect the quality of the page.\n\n I completely understand that many websites rely on advertising content to fund their upkeep, but when those adverts are excessive, and block the majority of the content in some way, shape or form, that's when I have the issue.\n\nI do not use adblocker on many sites, as I like to help said websites exist. I also am completely happy about sponsored content (albeit not biased), like SciShow and LinusTechTips, who give a brief mention at the start/end of the show that they were funded by a company, to produce this content, which was not influenced by the funding from said company.\n\nTo a lesser extent, I'm not too happy about companies that pay content producers to promote their products, without mentioning the negatives, so as to balance the opinion out. If the content producer mentions that they were paid by a company, to talk (but not covertly advertise) about the product, that's fine with me. For those of you who have kept reading and are interested about video-promotion law, [Tom Scott](https://www.youtube.com/watch?v=4SyetdjWMuw) has an excellent video on this.", "id": "d2y6gg0"}], [{"comment": "You could put a warning flair on the link that says \"does not support ad-block\".  That could be affective ", "id": "d2y8dyy"}], [{"comment": "i had a computer get malware from an ad, it sucks but i'm in agreement with this decision. ", "id": "d2ya5ub"}], [{"comment": "I'm all for it.", "id": "d2ybocx"}], [{"comment": "Do it. I have a few filtered, but having them all blocked would be even better.", "id": "d2yd2pq"}]]]}